export const stock_basic = {
  request_id: '18d2d6361aef11edb95e21e9e9e79eb2',
  code: 0,
  msg: '',
  data: {
    fields: ['ts_code', 'symbol', 'name', 'area', 'industry', 'market', 'list_date'],
    items: [
      ['000001.SZ', '000001', '平安银行', '深圳', '银行', '主板', '19910403'],
      ['000002.SZ', '000002', '万科A', '深圳', '全国地产', '主板', '19910129'],
      ['000004.SZ', '000004', 'ST国华', '深圳', '软件服务', '主板', '19910114'],
      ['000005.SZ', '000005', 'ST星源', '深圳', '环境保护', '主板', '19901210'],
      ['000006.SZ', '000006', '深振业A', '深圳', '区域地产', '主板', '19920427'],
    ],
    has_more: true,
  },
};

export const daily = {
  request_id: '3b7756221af311ed9e13c726b4240f10',
  code: 0,
  msg: '',
  data: {
    fields: [
      'ts_code',
      'trade_date',
      'open',
      'high',
      'low',
      'close',
      'pre_close',
      'change',
      'pct_chg',
      'vol',
      'amount',
    ],
    items: [
      ['689009.SH', '20220812', 57.85, 58.98, 56.65, 57.0, 56.99, 0.01, 0.0175, 22631.71, 130297.362],
      ['873223.BJ', '20220812', 4.19, 4.24, 4.01, 4.02, 4.19, -0.17, -4.0573, 49870.36, 20268.145],
      ['873169.BJ', '20220812', 6.71, 6.82, 6.48, 6.5, 6.69, -0.19, -2.8401, 14837.76, 9855.842],
      ['872925.BJ', '20220812', 16.1, 16.25, 16.05, 16.25, 16.07, 0.18, 1.1201, 144.02, 232.6],
    ],
  },
  has_more: true,
};
